# Handling Missing Values

### Nulls can be handle in 2 ways

1. Drop them
2. Replace them

### Approach for handling the Null Values 

<br>

1. If column has Nulls more than 30% ---> Drop the column
<br>
2. If Nulls are less than 10% or 30% ---> Try to Replace them

<br>
Replace :

`(a)` If Nulls are present in categorical Column ----> Use Mode to replace
<br>
`(b)` If Nulls are present in the numerical Column ---> Use Mean/Median to replace

In [1]:
import pandas as pd

import numpy as np

In [2]:
names = ["A","B","C","D",np.NaN]

phy = [12,13,np.NaN,15,np.NaN]

maths  = [45,1,5,np.NaN,np.NaN]

pet = [np.NaN]*5



# np.NaN can be written as None,NaT & NaN

In [3]:
# Creating the DF


mdf = pd.DataFrame({"Names": names, "Physics": phy, "Maths":maths, "PET" : pet})

mdf

  Names  Physics  Maths  PET
0     A     12.0   45.0  NaN
1     B     13.0    1.0  NaN
2     C      NaN    5.0  NaN
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN

#### In this DF we have -

1. Complete column with nulls
2. Complete row with nulls
3. Nulls in between

## WAY 1 - Drop them

#### how = "any"   means   

If any row or column has at least single null, then it will eliminate the whole column/row


#### how = "all"     means

If row/column is full of null then only it will eliminate the whole column/row otherwise it will keep the row/column

#####  how = "any"

In [14]:
# Dropping nulls from the rows

mdf.dropna(how = "any", axis =0)        # axis = 0 means row & axis = 1 means column




# Here, all rows has at least one null, that's why eliminated all the rows

Empty DataFrame
Columns: [Names, Physics, Maths, PET]
Index: []

In [16]:
# Dropping nulls from the column

mdf.dropna(how = "any", axis =1)        # axis = 0 means row & axis = 1 means column




# Here, all column has at least one null, that's why eliminated all the columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

#### how = "all"

In [18]:
# Dropping nulls from the column


mdf.dropna(how = "all", axis =0)        # axis = 0 means row & axis = 1 means column




# Here, only one row is full of null, that's why eliminated only that one row

  Names  Physics  Maths  PET
0     A     12.0   45.0  NaN
1     B     13.0    1.0  NaN
2     C      NaN    5.0  NaN
3     D     15.0    NaN  NaN

In [19]:
# Dropping nulls from the column


mdf.dropna(how = "all", axis =1)        # axis = 0 means row & axis = 1 means column




# Here, only one column is full of null, that's why eliminated only that one column

  Names  Physics  Maths
0     A     12.0   45.0
1     B     13.0    1.0
2     C      NaN    5.0
3     D     15.0    NaN
4   NaN      NaN    NaN

In [22]:
mdf



# these functions does not make changes in the orginal DF 

# If we want to make permanent changes in DF then we have use function, inplace = True

  Names  Physics  Maths  PET
0     A     12.0   45.0  NaN
1     B     13.0    1.0  NaN
2     C      NaN    5.0  NaN
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN

## WAY 2 - Replace them

In [4]:
mdf

  Names  Physics  Maths  PET
0     A     12.0   45.0  NaN
1     B     13.0    1.0  NaN
2     C      NaN    5.0  NaN
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN

### (a)  Replace/fill all the Null values with same value

In [5]:

# fillna  --->  fill all the null with a specified value


mdf.fillna(10)


# So, here where ever  the null is present, it has filled with the specified value i.e 10

  Names  Physics  Maths   PET
0     A     12.0   45.0  10.0
1     B     13.0    1.0  10.0
2     C     10.0    5.0  10.0
3     D     15.0   10.0  10.0
4    10     10.0   10.0  10.0

### (b) Replace/fill the particular Nulls with specified value

In [6]:
mdf

  Names  Physics  Maths  PET
0     A     12.0   45.0  NaN
1     B     13.0    1.0  NaN
2     C      NaN    5.0  NaN
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN

In [7]:
# Replace the Null with the 'E' in the column "Names"


mdf["Names"].fillna("E")

0    A
1    B
2    C
3    D
4    E
Name: Names, dtype: object

In [8]:
# Fill the Null vaules with mean value present in the column Physics 


# Step 1-

mdf["Physics"].mean()

13.333333333333334

In [9]:
# Step 2-


mdf["Physics"].fillna(mdf["Physics"].mean())


# So, in Physics we have 2 Nulls & we have replaced it with the mean value

0    12.000000
1    13.000000
2    13.333333
3    15.000000
4    13.333333
Name: Physics, dtype: float64

In [10]:
# If I want only 2 decimal values then


mdf["Physics"].fillna(round(mdf["Physics"].mean(),2))

0    12.00
1    13.00
2    13.33
3    15.00
4    13.33
Name: Physics, dtype: float64

In [11]:

# Replace the Null values present in the column Physics & Maths with max marks/values


mdf[["Physics","Maths"]].fillna(round(mdf[["Physics","Maths"]].max(),2))


# So, here it fill all nulls with value 15 for column Physics and fill nulls with 45 for column Maths

   Physics  Maths
0     12.0   45.0
1     13.0    1.0
2     15.0    5.0
3     15.0   45.0
4     15.0   45.0

In [12]:
mdf

  Names  Physics  Maths  PET
0     A     12.0   45.0  NaN
1     B     13.0    1.0  NaN
2     C      NaN    5.0  NaN
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN

# isnull


1. It gives boolean values
2. Used to find wheather Null Values are present in the column/rows or not

In [13]:
mdf.isnull()


# Here gives the output in the boolean value

   Names  Physics  Maths   PET
0  False    False  False  True
1  False    False  False  True
2  False     True  False  True
3  False    False   True  True
4   True     True   True  True

In [14]:
# If I want to find how many Nulls are present in every column


mdf.isnull().sum()

Names      1
Physics    2
Maths      2
PET        5
dtype: int64

# isna


- isna works same as isnull

In [21]:
# I want to check Nulls in the particular column "Maths" then give all those rows where null is present

mdf[mdf["Maths"].isna()]

  Names  Physics  Maths  PET
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN

In [24]:
mdf["Maths"].isnull()

0    False
1    False
2    False
3     True
4     True
Name: Maths, dtype: bool

In [19]:
mdf[mdf["Maths"].isnull()]

  Names  Physics  Maths  PET
3     D     15.0    NaN  NaN
4   NaN      NaN    NaN  NaN